# Введите два числа так чтобы вышел выходной, если суббота и воскресенье 6 и 7



# a = int (input ("Введите число от 1 до 7: "))
# if (a == 6) or (a == 7):
#     print('ДА')
# else:
#     print('НЕТ')


# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).


# a = int(input("Введите х: "))
# b = int(input("Введите y: "))
# if (a < 0) and ( b <0):
#     print ('Четверть номер 3')
# if (a > 0) and ( b > 0):
#     print ('Четверть номер 1')
# По аналогии делаем и другие четверти



