# Пользователь вводит с клавиатуры два числа. Нужно
# посчитать сумму чисел в указанном диапазоне, а также
# среднеарифметическое.

# a = int (input ("Введите число a:  "))
# b = int (input ("Введите число b:  "))
# count = 0
# sum_result = 0
# for i in range (a,b+1):
#     print (i)
#     count = count + 1
#     sum_result = i + sum_result
# avg_result = sum_result / count
# print (avg_result, sum_result)


# Пользователь вводит с клавиатуры число. Требуется
# посчитать факториал числа. Например, если введено 3,
# факториал числа 1*2*3 = 6.
# Формула для расчета факториала: n! = 1*2*3…*n,где
# n — число для расчета факториала.

# a = int (input ("Введите число a:  "))
# result = 1
# while a > 1:
#        result = result * a
#        a = a - 1
#        print (result)
# print (result)       


# Пользователь вводит с клавиатуры длину линии.
# Нужно отобразить на экране горизонтальную линию
# из *, указанной длины.
# Например, если было введено 7, тогда вывод на экран
# будет такой: *******


a = int (input ("Введите длину линии:  "))
